[
  {
    "title": "Sistema de Autoatendimento",
    "imageSrc": "projects/mcProjeto.png",
    "description": "   Este sistema moderniza o processo de pedidos em restaurantes, inspirado nos totens de autoatendimento de redes como McDonald's e Burger King. Ele permite que os clientes façam pedidos de forma independente e eficiente, tanto em versões web quanto mobile. O sistema inclui verificação de CPF para autenticação, vinculação ao histórico do cliente e armazenamento de pedidos no banco de dados para consultas futuras",
    "skills": [
      "Next.js",
      "TypeScript",
      "Prisma",
      "NeonDB",
      "PostgreSQL",
      "Tailwind CSS",
      "Figma"
    ],
    "demo": "https://matheusdonalds.vercel.app/fsw-donalds",
    "source": "https://github.com/MatheusOtenio/McDonald-s"
  },
  {
    "title": "Pokémon Game",
    "imageSrc": "projects/pokemonProjeto.png",
    "description": "   O Pokémon Game é um jogo interativo desenvolvido com JavaScript e HTML5 Canvas, permitindo que os jogadores explorem um mundo aberto e participem de batalhas dinâmicas. O sistema de batalha é inspirado nos clássicos Pokémon, com ataques dinâmicos e som imersivo. O mapa, criado com o software Tiled, inclui colisões para garantir a navegação adequada e uma experiência divertida.",
    "skills": ["JavaScript", "HTML5 Canvas", "CSS3"],
    "demo": "https://pokemonyt-mathues-otenio.netlify.app/",
    "source": "https://github.com/MatheusOtenio/PokemonGameYT-WEB"
  },
  {
    "title": "MIPS Simulator",
    "imageSrc": "projects/mipsProjeto.png",
    "description": "   O MIPS Simulator simula o funcionamento de um processador MIPS. Desenvolvido em Python com Tkinter, permite visualizar registradores, memória e executar instruções passo a passo. O simulador traduz o código binário para Assembly, facilitando o entendimento do processador. Foi criado como parte da disciplina de Arquitetura e Organização de Computadores.",
    "skills": ["Python", "MIPS", "Assembly", "Tkinter"],
    "source": "https://github.com/MatheusOtenio/Simulador_Mips"
  }
]
